*** crates/embyr-core/src/domain/project.rs:103:21: replace || with && in is_valid_project_id

*** mutation diff:
--- crates/embyr-core/src/domain/project.rs
+++ replace || with && in is_valid_project_id
@@ -95,17 +95,17 @@
 
     #[test]
     fn starts_with_dash_invalid() {
         assert!(ProjectId::new("-abc").is_err());
     }
 }
 
 fn is_valid_project_id(s: &str) -> bool {
-    if s.is_empty() || s.len() > 63 {
+    if s.is_empty() && /* ~ changed by cargo-mutants ~ */ s.len() > 63 {
         return false;
     }
     let mut chars = s.chars();
     match chars.next() {
         Some(c) if c.is_ascii_lowercase() => {}
         _ => return false,
     }
     chars.all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')

---- domain::project::tests::string_64_chars_invalid stdout ----

thread 'domain::project::tests::string_64_chars_invalid' (1320518) panicked at crates/embyr-core/src/domain/project.rs:48:9:
assertion failed: ProjectId::new(s).is_err()

failures:
    domain::project::tests::string_64_chars_invalid

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.02s

*** result: Failure(101)
