*** crates/embyr-core/src/auth/argon2.rs:10:5: replace argon2_instance -> Argon2<'static> with Default::default()

*** mutation diff:
--- crates/embyr-core/src/auth/argon2.rs
+++ replace argon2_instance -> Argon2<'static> with Default::default()
@@ -2,21 +2,17 @@
     password_hash::{PasswordHash, PasswordHasher, PasswordVerifier, SaltString},
     Algorithm, Argon2, Params, Version,
 };
 use rand_core::OsRng;
 
 use crate::error::CoreError;
 
 fn argon2_instance() -> Argon2<'static> {
-    Argon2::new(
-        Algorithm::Argon2id,
-        Version::V0x13,
-        Params::new(65536, 3, 4, Some(32)).expect("valid argon2 params"),
-    )
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn hash_api_key(api_key: &[u8]) -> Result<String, CoreError> {
     let salt = SaltString::generate(&mut OsRng);
     let hash = argon2_instance()
         .hash_password(api_key, &salt)
         .map_err(|e| CoreError::InvalidArgument(e.to_string()))?;
     Ok(hash.to_string())

---- auth::argon2::tests::argon2id_phc_string_encodes_required_params stdout ----

thread 'auth::argon2::tests::argon2id_phc_string_encodes_required_params' (1309243) panicked at crates/embyr-core/src/auth/argon2.rs:63:9:
must use memory=65536 KiB, got: $argon2id$v=19$m=19456,t=2,p=1$SAIu9NwR02MHM4srdrDuXg$VYCh7jfCa0HItE0Bf/WLk17C2HWRY8vRcNifuWSrAFw

failures:
    auth::argon2::tests::argon2id_phc_string_encodes_required_params

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
