*** crates/embyr-core/src/domain/project.rs:103:5: replace is_valid_project_id -> bool with true

*** mutation diff:
--- crates/embyr-core/src/domain/project.rs
+++ replace is_valid_project_id -> bool with true
@@ -95,25 +95,17 @@
 
     #[test]
     fn starts_with_dash_invalid() {
         assert!(ProjectId::new("-abc").is_err());
     }
 }
 
 fn is_valid_project_id(s: &str) -> bool {
-    if s.is_empty() || s.len() > 63 {
-        return false;
-    }
-    let mut chars = s.chars();
-    match chars.next() {
-        Some(c) if c.is_ascii_lowercase() => {}
-        _ => return false,
-    }
-    chars.all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ProjectStatus {
     Active,
     Suspended,
     Deleted,
 }

---- domain::project::tests::contains_uppercase_invalid stdout ----

thread 'domain::project::tests::contains_uppercase_invalid' (1319834) panicked at crates/embyr-core/src/domain/project.rs:72:9:
assertion failed: ProjectId::new("abcDef").is_err()

---- domain::project::tests::contains_underscore_invalid stdout ----

thread 'domain::project::tests::contains_underscore_invalid' (1319833) panicked at crates/embyr-core/src/domain/project.rs:78:9:
assertion failed: ProjectId::new("abc_def").is_err()

---- domain::project::tests::empty_string_invalid stdout ----

thread 'domain::project::tests::empty_string_invalid' (1319836) panicked at crates/embyr-core/src/domain/project.rs:41:9:
assertion failed: ProjectId::new("").is_err()

failures:
    domain::project::tests::contains_underscore_invalid
    domain::project::tests::contains_uppercase_invalid
    domain::project::tests::empty_string_invalid
    domain::project::tests::starts_with_dash_invalid
    domain::project::tests::starts_with_digit_invalid
    domain::project::tests::starts_with_uppercase_invalid
    domain::project::tests::string_64_chars_invalid

test result: FAILED. 17 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.15s

*** result: Failure(101)
