*** crates/embyr-core/src/auth/argon2.rs:18:5: replace hash_api_key -> Result<String, CoreError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/embyr-core/src/auth/argon2.rs
+++ replace hash_api_key -> Result<String, CoreError> with Ok("xyzzy".into())
@@ -10,21 +10,17 @@
     Argon2::new(
         Algorithm::Argon2id,
         Version::V0x13,
         Params::new(65536, 3, 4, Some(32)).expect("valid argon2 params"),
     )
 }
 
 pub fn hash_api_key(api_key: &[u8]) -> Result<String, CoreError> {
-    let salt = SaltString::generate(&mut OsRng);
-    let hash = argon2_instance()
-        .hash_password(api_key, &salt)
-        .map_err(|e| CoreError::InvalidArgument(e.to_string()))?;
-    Ok(hash.to_string())
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn verify_api_key(api_key: &[u8], phc_hash: &str) -> Result<bool, CoreError> {
     let parsed = PasswordHash::new(phc_hash)
         .map_err(|e| CoreError::InvalidArgument(e.to_string()))?;
     Ok(argon2_instance().verify_password(api_key, &parsed).is_ok())
 }

---- auth::argon2::tests::argon2id_wrong_key_does_not_verify stdout ----

thread 'auth::argon2::tests::argon2id_wrong_key_does_not_verify' (1310168) panicked at crates/embyr-core/src/auth/argon2.rs:41:54:
called `Result::unwrap()` on an `Err` value: InvalidArgument("password hash string missing field")

---- auth::argon2::tests::argon2id_hash_and_verify_roundtrip stdout ----

thread 'auth::argon2::tests::argon2id_hash_and_verify_roundtrip' (1310165) panicked at crates/embyr-core/src/auth/argon2.rs:35:44:
called `Result::unwrap()` on an `Err` value: InvalidArgument("password hash string missing field")

---- auth::argon2::tests::argon2id_two_hashes_of_same_key_are_different_but_both_verify stdout ----

thread 'auth::argon2::tests::argon2id_two_hashes_of_same_key_are_different_but_both_verify' (1310167) panicked at crates/embyr-core/src/auth/argon2.rs:49:9:
assertion `left != right` failed: random salts must differ
  left: "xyzzy"
 right: "xyzzy"

failures:
    auth::argon2::tests::argon2id_hash_and_verify_roundtrip
    auth::argon2::tests::argon2id_phc_string_encodes_required_params
    auth::argon2::tests::argon2id_two_hashes_of_same_key_are_different_but_both_verify
    auth::argon2::tests::argon2id_wrong_key_does_not_verify

test result: FAILED. 20 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
