*** crates/embyr-core/src/domain/project.rs:103:32: replace > with < in is_valid_project_id

*** mutation diff:
--- crates/embyr-core/src/domain/project.rs
+++ replace > with < in is_valid_project_id
@@ -95,17 +95,17 @@
 
     #[test]
     fn starts_with_dash_invalid() {
         assert!(ProjectId::new("-abc").is_err());
     }
 }
 
 fn is_valid_project_id(s: &str) -> bool {
-    if s.is_empty() || s.len() > 63 {
+    if s.is_empty() || s.len() < /* ~ changed by cargo-mutants ~ */ 63 {
         return false;
     }
     let mut chars = s.chars();
     match chars.next() {
         Some(c) if c.is_ascii_lowercase() => {}
         _ => return false,
     }
     chars.all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')

---- domain::project::tests::dash_only_after_start_valid stdout ----

thread 'domain::project::tests::dash_only_after_start_valid' (1339586) panicked at crates/embyr-core/src/domain/project.rs:93:9:
assertion failed: ProjectId::new("a-b-c").is_ok()

---- domain::project::tests::single_lowercase_char_valid stdout ----

thread 'domain::project::tests::single_lowercase_char_valid' (1339590) panicked at crates/embyr-core/src/domain/project.rs:83:9:
assertion failed: ProjectId::new("a").is_ok()

---- domain::project::tests::project_id_as_str_returns_original_value stdout ----

thread 'domain::project::tests::project_id_as_str_returns_original_value' (1339589) panicked at crates/embyr-core/src/domain/project.rs:32:47:
called `Result::unwrap()` on an `Err` value: InvalidArgument("project id must match ^[a-z][a-z0-9-]{0,62}$, got: my-project")

failures:
    domain::project::tests::dash_only_after_start_valid
    domain::project::tests::lowercase_digits_dashes_valid
    domain::project::tests::project_id_as_str_returns_original_value
    domain::project::tests::single_lowercase_char_valid
    domain::project::tests::string_64_chars_invalid

test result: FAILED. 20 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.98s

*** result: Failure(101)
