*** crates/embyr-core/src/auth/blake3.rs:2:5: replace derive_cache_key -> [u8; 32] with [0; 32]

*** mutation diff:
--- crates/embyr-core/src/auth/blake3.rs
+++ replace derive_cache_key -> [u8; 32] with [0; 32]
@@ -1,10 +1,10 @@
 pub fn derive_cache_key(api_key: &[u8]) -> [u8; 32] {
-    *blake3::hash(api_key).as_bytes()
+    [0; 32] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn blake3_cache_key_is_deterministic() {

---- auth::blake3::tests::blake3_different_inputs_produce_different_keys stdout ----

thread 'auth::blake3::tests::blake3_different_inputs_produce_different_keys' (1311648) panicked at crates/embyr-core/src/auth/blake3.rs:20:9:
assertion `left != right` failed
  left: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
 right: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

failures:
    auth::blake3::tests::blake3_different_inputs_produce_different_keys

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.32s

*** result: Failure(101)
