*** crates/embyr-core/src/domain/project.rs:108:20: replace match guard c.is_ascii_lowercase() with true in is_valid_project_id

*** mutation diff:
--- crates/embyr-core/src/domain/project.rs
+++ replace match guard c.is_ascii_lowercase() with true in is_valid_project_id
@@ -100,17 +100,17 @@
 }
 
 fn is_valid_project_id(s: &str) -> bool {
     if s.is_empty() || s.len() > 63 {
         return false;
     }
     let mut chars = s.chars();
     match chars.next() {
-        Some(c) if c.is_ascii_lowercase() => {}
+        Some(c) if true /* ~ changed by cargo-mutants ~ */ => {}
         _ => return false,
     }
     chars.all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ProjectStatus {
     Active,

---- domain::project::tests::starts_with_dash_invalid stdout ----

thread 'domain::project::tests::starts_with_dash_invalid' (1340298) panicked at crates/embyr-core/src/domain/project.rs:98:9:
assertion failed: ProjectId::new("-abc").is_err()

---- domain::project::tests::starts_with_digit_invalid stdout ----

thread 'domain::project::tests::starts_with_digit_invalid' (1340299) panicked at crates/embyr-core/src/domain/project.rs:61:9:
assertion failed: ProjectId::new("1abc").is_err()

---- domain::project::tests::starts_with_uppercase_invalid stdout ----

thread 'domain::project::tests::starts_with_uppercase_invalid' (1340300) panicked at crates/embyr-core/src/domain/project.rs:66:9:
assertion failed: ProjectId::new("Abc").is_err()

failures:
    domain::project::tests::starts_with_dash_invalid
    domain::project::tests::starts_with_digit_invalid
    domain::project::tests::starts_with_uppercase_invalid

test result: FAILED. 22 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.91s

*** result: Failure(101)
