*** crates/embyr-core/src/auth/ecies.rs:20:5: replace derive_aes_key -> [u8; 32] with [1; 32]

*** mutation diff:
--- crates/embyr-core/src/auth/ecies.rs
+++ replace derive_aes_key -> [u8; 32] with [1; 32]
@@ -12,20 +12,17 @@
 fn derive_static_secret(api_key: &[u8]) -> StaticSecret {
     let hk = Hkdf::<Sha256>::new(Some(b"embyr-ecies-v1-static"), api_key);
     let mut okm = [0u8; 32];
     hk.expand(&[], &mut okm).expect("32 bytes always valid for HKDF");
     StaticSecret::from(okm)
 }
 
 fn derive_aes_key(shared_secret: &[u8]) -> [u8; 32] {
-    let hk = Hkdf::<Sha256>::new(Some(b"embyr-ecies-v1-enc"), shared_secret);
-    let mut okm = [0u8; 32];
-    hk.expand(&[], &mut okm).expect("32 bytes valid");
-    okm
+    [1; 32] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn derive_public_key(api_key: &[u8]) -> [u8; 32] {
     let secret = derive_static_secret(api_key);
     PublicKey::from(&secret).to_bytes()
 }
 
 pub fn encrypt(recipient_pubkey: &[u8; 32], plaintext: &[u8]) -> Result<Vec<u8>, CoreError> {

---- auth::ecies::tests::ecies_wrong_api_key_fails_to_decrypt stdout ----

thread 'auth::ecies::tests::ecies_wrong_api_key_fails_to_decrypt' (1312729) panicked at crates/embyr-core/src/auth/ecies.rs:81:9:
assertion failed: result.is_err()

failures:
    auth::ecies::tests::ecies_wrong_api_key_fails_to_decrypt

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.76s

*** result: Failure(101)
