*** crates/embyr-core/src/domain/project.rs:108:20: replace match guard c.is_ascii_lowercase() with false in is_valid_project_id

*** mutation diff:
--- crates/embyr-core/src/domain/project.rs
+++ replace match guard c.is_ascii_lowercase() with false in is_valid_project_id
@@ -100,17 +100,17 @@
 }
 
 fn is_valid_project_id(s: &str) -> bool {
     if s.is_empty() || s.len() > 63 {
         return false;
     }
     let mut chars = s.chars();
     match chars.next() {
-        Some(c) if c.is_ascii_lowercase() => {}
+        Some(c) if false /* ~ changed by cargo-mutants ~ */ => {}
         _ => return false,
     }
     chars.all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ProjectStatus {
     Active,

---- domain::project::tests::dash_only_after_start_valid stdout ----

thread 'domain::project::tests::dash_only_after_start_valid' (1340626) panicked at crates/embyr-core/src/domain/project.rs:93:9:
assertion failed: ProjectId::new("a-b-c").is_ok()

---- domain::project::tests::lowercase_digits_dashes_valid stdout ----

thread 'domain::project::tests::lowercase_digits_dashes_valid' (1340628) panicked at crates/embyr-core/src/domain/project.rs:88:9:
assertion failed: ProjectId::new("my-project-123").is_ok()

---- domain::project::tests::project_id_as_str_returns_original_value stdout ----

thread 'domain::project::tests::project_id_as_str_returns_original_value' (1340629) panicked at crates/embyr-core/src/domain/project.rs:32:47:
called `Result::unwrap()` on an `Err` value: InvalidArgument("project id must match ^[a-z][a-z0-9-]{0,62}$, got: my-project")

failures:
    domain::project::tests::dash_only_after_start_valid
    domain::project::tests::lowercase_digits_dashes_valid
    domain::project::tests::project_id_as_str_returns_original_value
    domain::project::tests::single_lowercase_char_valid
    domain::project::tests::string_63_chars_valid

test result: FAILED. 20 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.26s

*** result: Failure(101)
