*** crates/embyr-core/src/domain/project.rs:111:64: replace || with && in is_valid_project_id

*** mutation diff:
--- crates/embyr-core/src/domain/project.rs
+++ replace || with && in is_valid_project_id
@@ -103,17 +103,17 @@
     if s.is_empty() || s.len() > 63 {
         return false;
     }
     let mut chars = s.chars();
     match chars.next() {
         Some(c) if c.is_ascii_lowercase() => {}
         _ => return false,
     }
-    chars.all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')
+    chars.all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() && /* ~ changed by cargo-mutants ~ */ c == '-')
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ProjectStatus {
     Active,
     Suspended,
     Deleted,
 }

---- domain::project::tests::dash_only_after_start_valid stdout ----

thread 'domain::project::tests::dash_only_after_start_valid' (1340951) panicked at crates/embyr-core/src/domain/project.rs:93:9:
assertion failed: ProjectId::new("a-b-c").is_ok()

---- domain::project::tests::lowercase_digits_dashes_valid stdout ----

thread 'domain::project::tests::lowercase_digits_dashes_valid' (1340953) panicked at crates/embyr-core/src/domain/project.rs:88:9:
assertion failed: ProjectId::new("my-project-123").is_ok()

---- domain::project::tests::project_id_as_str_returns_original_value stdout ----

thread 'domain::project::tests::project_id_as_str_returns_original_value' (1340954) panicked at crates/embyr-core/src/domain/project.rs:32:47:
called `Result::unwrap()` on an `Err` value: InvalidArgument("project id must match ^[a-z][a-z0-9-]{0,62}$, got: my-project")

failures:
    domain::project::tests::dash_only_after_start_valid
    domain::project::tests::lowercase_digits_dashes_valid
    domain::project::tests::project_id_as_str_returns_original_value

test result: FAILED. 22 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.95s

*** result: Failure(101)
