*** crates/embyr-core/src/domain/project.rs:111:69: replace == with != in is_valid_project_id

*** mutation diff:
--- crates/embyr-core/src/domain/project.rs
+++ replace == with != in is_valid_project_id
@@ -103,17 +103,17 @@
     if s.is_empty() || s.len() > 63 {
         return false;
     }
     let mut chars = s.chars();
     match chars.next() {
         Some(c) if c.is_ascii_lowercase() => {}
         _ => return false,
     }
-    chars.all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c == '-')
+    chars.all(|c| c.is_ascii_lowercase() || c.is_ascii_digit() || c != /* ~ changed by cargo-mutants ~ */ '-')
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ProjectStatus {
     Active,
     Suspended,
     Deleted,
 }

---- domain::project::tests::contains_underscore_invalid stdout ----

thread 'domain::project::tests::contains_underscore_invalid' (1341607) panicked at crates/embyr-core/src/domain/project.rs:78:9:
assertion failed: ProjectId::new("abc_def").is_err()

---- domain::project::tests::contains_uppercase_invalid stdout ----

thread 'domain::project::tests::contains_uppercase_invalid' (1341608) panicked at crates/embyr-core/src/domain/project.rs:72:9:
assertion failed: ProjectId::new("abcDef").is_err()

---- domain::project::tests::dash_only_after_start_valid stdout ----

thread 'domain::project::tests::dash_only_after_start_valid' (1341609) panicked at crates/embyr-core/src/domain/project.rs:93:9:
assertion failed: ProjectId::new("a-b-c").is_ok()

failures:
    domain::project::tests::contains_underscore_invalid
    domain::project::tests::contains_uppercase_invalid
    domain::project::tests::dash_only_after_start_valid
    domain::project::tests::lowercase_digits_dashes_valid
    domain::project::tests::project_id_as_str_returns_original_value

test result: FAILED. 20 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.15s

*** result: Failure(101)
