*** crates/embyr-core/src/auth/argon2.rs:26:5: replace verify_api_key -> Result<bool, CoreError> with Ok(false)

*** mutation diff:
--- crates/embyr-core/src/auth/argon2.rs
+++ replace verify_api_key -> Result<bool, CoreError> with Ok(false)
@@ -18,19 +18,17 @@
     let salt = SaltString::generate(&mut OsRng);
     let hash = argon2_instance()
         .hash_password(api_key, &salt)
         .map_err(|e| CoreError::InvalidArgument(e.to_string()))?;
     Ok(hash.to_string())
 }
 
 pub fn verify_api_key(api_key: &[u8], phc_hash: &str) -> Result<bool, CoreError> {
-    let parsed = PasswordHash::new(phc_hash)
-        .map_err(|e| CoreError::InvalidArgument(e.to_string()))?;
-    Ok(argon2_instance().verify_password(api_key, &parsed).is_ok())
+    Ok(false) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn argon2id_hash_and_verify_roundtrip() {

---- auth::argon2::tests::argon2id_hash_and_verify_roundtrip stdout ----

thread 'auth::argon2::tests::argon2id_hash_and_verify_roundtrip' (1330810) panicked at crates/embyr-core/src/auth/argon2.rs:37:9:
assertion failed: verify_api_key(key, &hash).unwrap()

---- auth::argon2::tests::argon2id_two_hashes_of_same_key_are_different_but_both_verify stdout ----

thread 'auth::argon2::tests::argon2id_two_hashes_of_same_key_are_different_but_both_verify' (1330812) panicked at crates/embyr-core/src/auth/argon2.rs:52:9:
assertion failed: verify_api_key(key, &h1).unwrap()

failures:
    auth::argon2::tests::argon2id_hash_and_verify_roundtrip
    auth::argon2::tests::argon2id_two_hashes_of_same_key_are_different_but_both_verify

test result: FAILED. 23 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.61s

*** result: Failure(101)
