*** crates/embyr-core/src/auth/ecies.rs:27:5: replace derive_public_key -> [u8; 32] with [1; 32]

*** mutation diff:
--- crates/embyr-core/src/auth/ecies.rs
+++ replace derive_public_key -> [u8; 32] with [1; 32]
@@ -19,18 +19,17 @@
 fn derive_aes_key(shared_secret: &[u8]) -> [u8; 32] {
     let hk = Hkdf::<Sha256>::new(Some(b"embyr-ecies-v1-enc"), shared_secret);
     let mut okm = [0u8; 32];
     hk.expand(&[], &mut okm).expect("32 bytes valid");
     okm
 }
 
 pub fn derive_public_key(api_key: &[u8]) -> [u8; 32] {
-    let secret = derive_static_secret(api_key);
-    PublicKey::from(&secret).to_bytes()
+    [1; 32] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn encrypt(recipient_pubkey: &[u8; 32], plaintext: &[u8]) -> Result<Vec<u8>, CoreError> {
     let eph_secret = EphemeralSecret::random_from_rng(OsRng);
     let eph_pub = PublicKey::from(&eph_secret);
     let shared = eph_secret.diffie_hellman(&PublicKey::from(*recipient_pubkey));
     let aes_key = derive_aes_key(shared.as_bytes());
     let cipher = Aes256Gcm::new(&aes_key.into());

---- auth::ecies::tests::ecies_encrypt_decrypt_roundtrip stdout ----

thread 'auth::ecies::tests::ecies_encrypt_decrypt_roundtrip' (1332773) panicked at crates/embyr-core/src/auth/ecies.rs:73:40:
called `Result::unwrap()` on an `Err` value: InvalidArgument("decryption failed")

---- auth::ecies::tests::ecies_encrypt_empty_plaintext_decrypts_successfully stdout ----

thread 'auth::ecies::tests::ecies_encrypt_empty_plaintext_decrypts_successfully' (1332774) panicked at crates/embyr-core/src/auth/ecies.rs:104:40:
called `Result::unwrap()` on an `Err` value: InvalidArgument("decryption failed")

failures:
    auth::ecies::tests::ecies_encrypt_decrypt_roundtrip
    auth::ecies::tests::ecies_encrypt_empty_plaintext_decrypts_successfully

test result: FAILED. 23 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.65s

*** result: Failure(101)
