*** crates/embyr-core/src/auth/ecies.rs:49:25: replace < with > in decrypt

*** mutation diff:
--- crates/embyr-core/src/auth/ecies.rs
+++ replace < with > in decrypt
@@ -41,17 +41,17 @@
     let mut out = Vec::with_capacity(32 + 12 + ct.len());
     out.extend_from_slice(eph_pub.as_bytes());
     out.extend_from_slice(&nonce);
     out.extend_from_slice(&ct);
     Ok(out)
 }
 
 pub fn decrypt(api_key: &[u8], ciphertext: &[u8]) -> Result<Vec<u8>, CoreError> {
-    if ciphertext.len() < 32 + 12 + 16 {
+    if ciphertext.len() > /* ~ changed by cargo-mutants ~ */ 32 + 12 + 16 {
         return Err(CoreError::InvalidArgument("ciphertext too short".into()));
     }
     let eph_pub_bytes: [u8; 32] = ciphertext[..32].try_into().unwrap();
     let nonce_bytes: [u8; 12] = ciphertext[32..44].try_into().unwrap();
     let ct = &ciphertext[44..];
     let static_secret = derive_static_secret(api_key);
     let shared = static_secret.diffie_hellman(&PublicKey::from(eph_pub_bytes));
     let aes_key = derive_aes_key(shared.as_bytes());

---- auth::ecies::tests::ecies_empty_ciphertext_rejected stdout ----

thread 'auth::ecies::tests::ecies_empty_ciphertext_rejected' (1335500) panicked at crates/embyr-core/src/auth/ecies.rs:52:45:
range end index 32 out of range for slice of length 0

---- auth::ecies::tests::ecies_encrypt_decrypt_roundtrip stdout ----

thread 'auth::ecies::tests::ecies_encrypt_decrypt_roundtrip' (1335501) panicked at crates/embyr-core/src/auth/ecies.rs:74:40:
called `Result::unwrap()` on an `Err` value: InvalidArgument("ciphertext too short")

failures:
    auth::ecies::tests::ecies_empty_ciphertext_rejected
    auth::ecies::tests::ecies_encrypt_decrypt_roundtrip

test result: FAILED. 23 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.12s

*** result: Failure(101)
