*** crates/embyr-core/src/auth/ecies.rs:49:5: replace decrypt -> Result<Vec<u8>, CoreError> with Ok(vec![1])

*** mutation diff:
--- crates/embyr-core/src/auth/ecies.rs
+++ replace decrypt -> Result<Vec<u8>, CoreError> with Ok(vec![1])
@@ -41,29 +41,17 @@
     let mut out = Vec::with_capacity(32 + 12 + ct.len());
     out.extend_from_slice(eph_pub.as_bytes());
     out.extend_from_slice(&nonce);
     out.extend_from_slice(&ct);
     Ok(out)
 }
 
 pub fn decrypt(api_key: &[u8], ciphertext: &[u8]) -> Result<Vec<u8>, CoreError> {
-    if ciphertext.len() < 32 + 12 + 16 {
-        return Err(CoreError::InvalidArgument("ciphertext too short".into()));
-    }
-    let eph_pub_bytes: [u8; 32] = ciphertext[..32].try_into().unwrap();
-    let nonce_bytes: [u8; 12] = ciphertext[32..44].try_into().unwrap();
-    let ct = &ciphertext[44..];
-    let static_secret = derive_static_secret(api_key);
-    let shared = static_secret.diffie_hellman(&PublicKey::from(eph_pub_bytes));
-    let aes_key = derive_aes_key(shared.as_bytes());
-    let cipher = Aes256Gcm::new(&aes_key.into());
-    cipher
-        .decrypt(&nonce_bytes.into(), ct)
-        .map_err(|_| CoreError::InvalidArgument("decryption failed".into()))
+    Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn ecies_encrypt_decrypt_roundtrip() {

---- auth::ecies::tests::ecies_ciphertext_59_bytes_rejected stdout ----

thread 'auth::ecies::tests::ecies_ciphertext_59_bytes_rejected' (1334813) panicked at crates/embyr-core/src/auth/ecies.rs:107:9:
59-byte ciphertext must be rejected

---- auth::ecies::tests::ecies_ciphertext_exactly_at_minimum_length_attempts_decrypt stdout ----

thread 'auth::ecies::tests::ecies_ciphertext_exactly_at_minimum_length_attempts_decrypt' (1334814) panicked at crates/embyr-core/src/auth/ecies.rs:115:9:
garbage 60-byte ciphertext must fail decryption (GCM tag mismatch)

---- auth::ecies::tests::ecies_wrong_api_key_fails_to_decrypt stdout ----

thread 'auth::ecies::tests::ecies_wrong_api_key_fails_to_decrypt' (1334819) panicked at crates/embyr-core/src/auth/ecies.rs:72:9:
assertion failed: result.is_err()

failures:
    auth::ecies::tests::ecies_ciphertext_59_bytes_rejected
    auth::ecies::tests::ecies_ciphertext_exactly_at_minimum_length_attempts_decrypt
    auth::ecies::tests::ecies_empty_ciphertext_rejected
    auth::ecies::tests::ecies_encrypt_decrypt_roundtrip
    auth::ecies::tests::ecies_encrypt_empty_plaintext_decrypts_successfully
    auth::ecies::tests::ecies_wrong_api_key_fails_to_decrypt

test result: FAILED. 19 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.86s

*** result: Failure(101)
